# WAVES

In [1]:
import pyodbc
import pandas as pd

In [2]:
cnxn = pyodbc.connect("Driver={ODBC Driver 17 for SQL Server};"
                        "Server=wd02;"
                        "Database=FootPrint;"
                        "UID=WOODFIELD\\jmeza@wdsrx.com;"
                        "PWD=Clavezaza2022;"
                        "Trusted_Connection=yes;")

### Query

In [3]:
df = pd.read_sql_query("SELECT CONVERT(varchar,w.releaseDate,100) Date, w.id, wa.name Warehouse, s.lookupCode Shipments, p.name Customer, ss.name ShipmentStatus\
    FROM datex_footprint.Waves w\
    JOIN datex_footprint.WaveStatuses ws\
        ON ws.id = w.statusId\
    JOIN datex_footprint.Warehouses wa\
        ON wa.id = w.warehouseId\
    JOIN datex_footprint.shipments s\
        ON s.waveId = w.id\
    JOIN datex_footprint.ShipmentOrderLookup sol\
        ON sol.shipmentId = s.id\
    JOIN datex_footprint.Orders o\
        ON o.id = sol.orderId\
    JOIN datex_footprint.Projects p\
        ON p.id = o.projectId\
    JOIN datex_footprint.ShipmentStatuses ss\
        ON ss.id = s.statusId\
    WHERE releaseDate > dateadd(day,-1,getdate())\
        AND w.statusId = 3\
    ORDER BY releaseDate DESC", cnxn)

# Create Waves Table Data

In [4]:
df.head(10)

,Date,id,Warehouse,Shipments,Customer,ShipmentStatus
0,Jan 30 2023 8:51AM,256140,12,HH8783.2,Hush Hush,Released
1,Jan 30 2023 8:51AM,256139,10,0086335841,ISDIN Corporation,Released
2,Jan 30 2023 8:51AM,256139,10,0086335895,ISDIN Corporation,Released
3,Jan 30 2023 8:51AM,256139,10,0086335896,ISDIN Corporation,Released
4,Jan 30 2023 8:51AM,256139,10,0086335906,ISDIN Corporation,Released
5,Jan 30 2023 8:51AM,256139,10,0086335909,ISDIN Corporation,Released
6,Jan 30 2023 8:51AM,256139,10,0086335911,ISDIN Corporation,Released
7,Jan 30 2023 8:51AM,256139,10,0086335910,ISDIN Corporation,Released
8,Jan 30 2023 8:51AM,256139,10,0086335925,ISDIN Corporation,Released
9,Jan 30 2023 8:51AM,256139,10,0086335995,ISDIN Corporation,Released

In [5]:
# Count Shipments per Wave and Status
count_shipments_statusdf = df.groupby(['id', 'ShipmentStatus']).count()[['Shipments']]
count_shipments_statusdf.reset_index(inplace=True)
count_shipments_statusdf.tail()

       id ShipmentStatus  Shipments
4  256135       Released         34
5  256137       Released          1
6  256138       Released          1
7  256139       Released         13
8  256140       Released          1

In [6]:
# Convert Statuses to Columns
shipment_pivot = count_shipments_statusdf.pivot(index='id', columns='ShipmentStatus', values='Shipments')
shipment_pivot.tail()

ShipmentStatus  Executing  Released
id
256135                NaN      34.0
256137                NaN       1.0
256138                NaN       1.0
256139                NaN      13.0
256140                NaN       1.0

In [7]:
# Convert NaN to 0
shipment_pivot = shipment_pivot.fillna(0)
shipment_pivot.head()

ShipmentStatus  Executing  Released
id
256131                6.0       5.0
256132                0.0       1.0
256133                0.0       1.0
256135                0.0      34.0
256137                0.0       1.0

In [8]:
# Convert Float to Int
try:
    shipment_pivot['Completed'] = shipment_pivot['Completed'].astype(int)
except:
    print('Column Completed does not exist yet')

try:
    shipment_pivot['Executing'] = shipment_pivot['Executing'].astype(int)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'] = shipment_pivot['Released'].astype(int)
except:
    print('Column Released does not exist yet')

shipment_pivot.head()

Column Completed does not exist yet

ShipmentStatus  Executing  Released
id
256131                  6         5
256132                  0         1
256133                  0         1
256135                  0        34
256137                  0         1

In [9]:
# Convert id index to a column
shipment_pivot.reset_index(inplace=True)
shipment_pivot.head()

ShipmentStatus      id  Executing  Released
0               256131          6         5
1               256132          0         1
2               256133          0         1
3               256135          0        34
4               256137          0         1

In [10]:
# Convert zeros to blanks. This also change the data type to String
try:
    shipment_pivot['Completed'].replace([0, ''], '', inplace=True)
except:
    print('Column Completed does not exist yet')
    
try:
    shipment_pivot['Executing'].replace([0, ''], '', inplace=True)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'].replace([0, ''], '', inplace=True)
except:
    print('Column Released does not exist yet')
    
shipment_pivot.head()

Column Completed does not exist yet

ShipmentStatus      id Executing  Released
0               256131         6         5
1               256132                   1
2               256133                   1
3               256135                  34
4               256137                   1

In [11]:
shipment_pivot.dtypes

ShipmentStatus
id            int64
Executing    object
Released      int32
dtype: object

In [12]:
# Change columns order
df = df[['Date', 'id', 'Warehouse', 'Customer']]

In [13]:
# Drops duplicates
df = df.drop_duplicates()

In [14]:
df.head(10)

                   Date      id Warehouse             Customer
0   Jan 30 2023  8:51AM  256140        12            Hush Hush
1   Jan 30 2023  8:51AM  256139        10    ISDIN Corporation
14  Jan 30 2023  8:47AM  256138        19       Graystone, LLC
15  Jan 30 2023  8:46AM  256137        19       Graystone, LLC
16  Jan 30 2023  8:40AM  256135        12            Hush Hush
50  Jan 30 2023  8:06AM  256133        22    NBTY Global, Inc.
51  Jan 30 2023  7:57AM  256132        19  AdvaGen Pharma, Ltd
52  Jan 30 2023  7:51AM  256131        19       Innogenix, LLC

In [15]:
# Merge df with pivot table
df2 = df.merge(shipment_pivot, left_on='id', right_on='id')
df2.head(10)

,Date,id,Warehouse,Customer,Executing,Released
0,Jan 30 2023 8:51AM,256140,12,Hush Hush,,1
1,Jan 30 2023 8:51AM,256139,10,ISDIN Corporation,,13
2,Jan 30 2023 8:47AM,256138,19,"Graystone, LLC",,1
3,Jan 30 2023 8:46AM,256137,19,"Graystone, LLC",,1
4,Jan 30 2023 8:40AM,256135,12,Hush Hush,,34
5,Jan 30 2023 8:06AM,256133,22,"NBTY Global, Inc.",,1
6,Jan 30 2023 7:57AM,256132,19,"AdvaGen Pharma, Ltd",,1
7,Jan 30 2023 7:51AM,256131,19,"Innogenix, LLC",6,5

In [16]:
wave_df = pd.DataFrame()
statuses = list(df2.columns)

# Reorder columns
if ('Released' in statuses) and ('Executing' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing', 'Completed']]
elif ('Released' in statuses) and ('Executing' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing']]
elif ('Released' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Completed']]
elif ('Released' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released']]
else:
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer']]

In [17]:
wave_df.head(10)

,Date,id,Warehouse,Customer,Released,Executing
0,Jan 30 2023 8:51AM,256140,12,Hush Hush,1,
1,Jan 30 2023 8:51AM,256139,10,ISDIN Corporation,13,
2,Jan 30 2023 8:47AM,256138,19,"Graystone, LLC",1,
3,Jan 30 2023 8:46AM,256137,19,"Graystone, LLC",1,
4,Jan 30 2023 8:40AM,256135,12,Hush Hush,34,
5,Jan 30 2023 8:06AM,256133,22,"NBTY Global, Inc.",1,
6,Jan 30 2023 7:57AM,256132,19,"AdvaGen Pharma, Ltd",1,
7,Jan 30 2023 7:51AM,256131,19,"Innogenix, LLC",5,6

In [18]:
# Save Waves DF into json file
wave_df.to_json('data/waves.json')

# Warehouse Pie Chart Data

In [19]:
# Save df2 in df3
warehouse_df = wave_df
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing
0,Jan 30 2023 8:51AM,256140,12,Hush Hush,1,
1,Jan 30 2023 8:51AM,256139,10,ISDIN Corporation,13,
2,Jan 30 2023 8:47AM,256138,19,"Graystone, LLC",1,
3,Jan 30 2023 8:46AM,256137,19,"Graystone, LLC",1,
4,Jan 30 2023 8:40AM,256135,12,Hush Hush,34,

In [20]:
# Conver String to Float
try:
    warehouse_df['Released'] = pd.to_numeric(warehouse_df['Released'],errors='coerce')
except:
    print('Column Released does not exist yet')

try:
    warehouse_df['Executing'] = pd.to_numeric(warehouse_df['Executing'],errors='coerce')
except:
    print('Column Executing does not exist yet')

try:
    warehouse_df['Completed'] = pd.to_numeric(warehouse_df['Completed'],errors='coerce')
except:
    print('Column Completed does not exist yet')

warehouse_df.head()

Column Completed does not exist yet

,Date,id,Warehouse,Customer,Released,Executing
0,Jan 30 2023 8:51AM,256140,12,Hush Hush,1,NaN
1,Jan 30 2023 8:51AM,256139,10,ISDIN Corporation,13,NaN
2,Jan 30 2023 8:47AM,256138,19,"Graystone, LLC",1,NaN
3,Jan 30 2023 8:46AM,256137,19,"Graystone, LLC",1,NaN
4,Jan 30 2023 8:40AM,256135,12,Hush Hush,34,NaN

In [21]:
# Conver NaN to Zero
warehouse_df = warehouse_df.fillna(0)
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing
0,Jan 30 2023 8:51AM,256140,12,Hush Hush,1,0.0
1,Jan 30 2023 8:51AM,256139,10,ISDIN Corporation,13,0.0
2,Jan 30 2023 8:47AM,256138,19,"Graystone, LLC",1,0.0
3,Jan 30 2023 8:46AM,256137,19,"Graystone, LLC",1,0.0
4,Jan 30 2023 8:40AM,256135,12,Hush Hush,34,0.0

In [22]:
# Group by Warehouse
warehouse_df = warehouse_df.groupby(['Warehouse']).sum()
warehouse_df

                id  Released  Executing
Warehouse
10          256139        13        0.0
12          512275        35        0.0
19         1024538         8        6.0
22          256133         1        0.0

In [23]:
# Reset Index
warehouse_df.reset_index(inplace=True)
warehouse_df

  Warehouse       id  Released  Executing
0        10   256139        13        0.0
1        12   512275        35        0.0
2        19  1024538         8        6.0
3        22   256133         1        0.0

In [24]:
warehouses = list(warehouse_df.columns)
warehouse_df2 = pd.DataFrame()

if ('Released' in warehouses) and ('Executing' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing', 'Completed']]
elif ('Released' in warehouses) and ('Executing' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing']]
elif ('Released' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Completed']]
elif ('Released' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released']]
else:
    warehouse_df2 = warehouse_df[['Warehouse']]

warehouse_df2

  Warehouse  Released  Executing
0        10        13        0.0
1        12        35        0.0
2        19         8        6.0
3        22         1        0.0

In [25]:
warehouse_df2 = pd.melt(warehouse_df2, id_vars=["Warehouse"], 
                  var_name="Status", value_name="Value")
warehouse_df2.head()

  Warehouse     Status  Value
0        10   Released   13.0
1        12   Released   35.0
2        19   Released    8.0
3        22   Released    1.0
4        10  Executing    0.0

In [26]:
warehouse_df3 = warehouse_df2.pivot(index ='Status', columns='Warehouse', values='Value')
warehouse_df3

Warehouse    10    12   19   22
Status
Executing   0.0   0.0  6.0  0.0
Released   13.0  35.0  8.0  1.0

In [27]:
warehouse_df4 = warehouse_df3.reset_index()
warehouse_df4

Warehouse     Status    10    12   19   22
0          Executing   0.0   0.0  6.0  0.0
1           Released  13.0  35.0  8.0  1.0

In [28]:
warehouse_df4 = warehouse_df4.rename_axis(None, axis=1)
warehouse_df4

      Status    10    12   19   22
0  Executing   0.0   0.0  6.0  0.0
1   Released  13.0  35.0  8.0  1.0

In [29]:
# Save Warehouse into JSON file
warehouse_df4.to_json('data/warehouse.json')

In [30]:
# Close connection
cnxn.close()